app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items`

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`price`, `updated_at`, `name`, `created_at`) VALUES(1, '2013-10-22 01:38:02', 'thebest', '2013-10-22 01:38:02')